#  Deleting a Column

##  to delete a column is to use drop with the parameter axis=1 (i.e., the column axis):

In [1]:
import pandas as pd

url = 'https://raw.githubusercontent.com/chrisalbon/simulated_datasets/master/titanic.csv'

df = pd.read_csv(url)
df.head(2)

                           Name PClass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1   Allison, Miss Helen Loraine    1st   2.0  female         0        1

In [4]:
df.drop("Age",axis=1).head(5)

,Name,PClass,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,female,1,1
1,"Allison, Miss Helen Loraine",1st,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,female,0,1
4,"Allison, Master Hudson Trevor",1st,male,1,0

In [5]:
df.drop(["Age","Name"],axis=1).head(5)

  PClass     Sex  Survived  SexCode
0    1st  female         1        1
1    1st  female         0        1
2    1st    male         0        0
3    1st  female         0        1
4    1st    male         1        0

## If a column does not have a name (which can sometimes happen), you can drop it by its column index using dataframe.columns:
## Drop column
## dataframe.drop(dataframe.columns[1], axis=1).head(2)

In [9]:
df.drop(df.columns[1],axis=1).head(3)

                                  Name   Age     Sex  Survived  SexCode
0         Allen, Miss Elisabeth Walton  29.0  female         1        1
1          Allison, Miss Helen Loraine   2.0  female         0        1
2  Allison, Mr Hudson Joshua Creighton  30.0    male         0        0

# One habit I recommend learning is to never use pandas’ inplace=True argument. Many pandas methods include an inplace parameter, which when True edits the DataFrame directly. This can lead to problems in more complex data processing pipe‐ lines because we are treating the DataFrames as mutable objects (which they techni‐cally are). I recommend treating DataFrames as immutable objects.

In [10]:
df_new = df.drop(df.columns[1:3],axis=1)

In [12]:
df_new.head(2)

                           Name     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton  female         1        1
1   Allison, Miss Helen Loraine  female         0        1

In [13]:
df.head(2)

                           Name PClass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1   Allison, Miss Helen Loraine    1st   2.0  female         0        1